Documents/ПланСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ПланСотрудника</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПланСотрудника</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланНаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельНаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатыСК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатыПРОФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаНарядов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднееВремяНаНаряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланПоКлиентам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Задача</v8:Type>
								<v8:Type>cfg:CatalogRef.итк_Задача</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭЧ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вероятность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВероятностьФактЭЧ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧтоНужноДляЗакрытия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтмены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаЧаса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаЧасаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПланСертификации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Компетенции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проф</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрофПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрофФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СК</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СКПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СКФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спец</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпецПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпецФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПланОтдела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ПланОтдела</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПланНаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦельНаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатыСК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатыПРОФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНарядов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднееВремяНаНаряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидПлана</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УчетСертефикации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>УчетСертефикации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Компетенция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компетенции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКомпетенции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипКомпетенции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидПлана</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипКомпетенции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ТипКомпетенции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПРОФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПЕЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Компетенции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Компетенции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПРОФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СПЕЦ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПланСотрудника/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтменитьЗадачу(Команда)
	// Вставить содержимое обработчика.
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтотОбъект);	
	ПоказатьВопрос(Оповещение,
	"Данная задача будет отмененна. Продолжить?",
	РежимДиалогаВопрос.ДаНет,
	0,КодВозвратаДиалога.Да,"Вопрос");
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", 
		ЭтотОбъект);
		ПоказатьВводСтроки(Оповещение,,"Укажите причину отмены",100,Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеВводаЗначения(Результат, Параметры) Экспорт
	
	Если Не Результат = Неопределено и Не Результат = ""  Тогда
		ъСтрокиКОтмене = ЭтотОбъект.Элементы.ПланПоКлиентам.ВыделенныеСтроки;
		Для Каждого стр из ъСтрокиКОтмене ЦИКЛ
			ъПар = Новый Структура;
			ъПар.Вставить("НомерСтроки",стр+1);
			ъСтрока = Объект.ПланПоКлиентам.НайтиСтроки(ъПар);
			ъСтрока[0].Отменена = Истина;
			ъСтрока[0].ПричинаОтмены = Результат;
		КонецЦикла;
	Иначе 
		Сообщить ("Причина не может быть пустой");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	
	Оповещение = Новый ОписаниеОповещения(
	"УстановитьИнтервалЗавершение",
	ЭтотОбъект);
	
	ОбщегоНазначенияУТКлиент.РедактироватьПериод(Объект, 
	Новый Структура("ДатаНачала, ДатаОкончания", "НачалоПериода", "КонецПериода"),Оповещение);
	
КонецПроцедуры

&НаСервере
Процедура КонецПериодаПриИзмененииНаСервере()
	
	ЗаполнитьПоДаннымПланаОтдела();
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	КонецПериодаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымПланаОтдела()
	
	Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ПланОтдела.ПланНаМесяц) КАК ПланНаМесяц,
	|	СУММА(ПланОтдела.ЦельНаМесяц) КАК ЦельНаМесяц,
	|	МАКСИМУМ(ПланОтдела.СертификатыСК) КАК СертификатыСК,
	|	МАКСИМУМ(ПланОтдела.СертификатыПРОФ) КАК СертификатыПРОФ,
	|	СУММА(ПланОтдела.НормаНарядов) КАК НормаНарядов,
	|	СРЕДНЕЕ(ПланОтдела.СреднееВремяНаНаряд) КАК СреднееВремяНаНаряд
	|ИЗ
	|	РегистрСведений.ПланОтдела КАК ПланОтдела
	|ГДЕ
	|	ПланОтдела.ВидПлана = ЗНАЧЕНИЕ(Перечисление.ВидПлана.Месяц)
	|	И ПланОтдела.Сотрудник = &Сотрудник
	|	И ПланОтдела.НачалоПериода >= &НачалоПериода
	|	И ПланОтдела.КонецПериода <= &КонецПериода";
	
	Запрос.УстановитьПараметр("КонецПериода", Объект.КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);	
	Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект, Выборка);		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоДаннымПланаОтдела();
	ЗаполнитьКомпетенции();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(Период, ДополнительныеПараметры) Экспорт 
	
	ЗаполнитьПоДаннымПланаОтдела();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
КонецПроцедуры

&НаСервере
Функция ПланПоКлиентамКлиентПриИзмененииНаСервере(Клиент)
	Возврат Клиент.Менеджер; 
КонецФункции

&НаКлиенте
Процедура ПланПоКлиентамКлиентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПланПоКлиентам.ТекущиеДанные;
	ТекущаяСтрока.Менеджер = ПланПоКлиентамКлиентПриИзмененииНаСервере(ТекущаяСтрока.Клиент);
	Ставки = ITC_ОбщиеСервер.СтавкиЧаса(ТекущаяСтрока.Клиент);
	ТекущаяСтрока.СтавкаЧаса = Ставки.Ставка;
	ТекущаяСтрока.СтавкаЧасаБезНДС = Ставки.СтавкаБезНДС;
	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтогиЭЧ()
	
	ИтогоЭЧ100 = 0;
	ИтогоЭЧНе100 = 0;
	
	Для каждого СтрПлан из Объект.ПланПоКлиентам Цикл
		Если СтрПлан.Вероятность = ВероятностьВыполненияПлана() Тогда
			ИтогоЭЧ100 = ИтогоЭЧ100 + СтрПлан.ЭЧ;
		Иначе
			ИтогоЭЧНе100 = ИтогоЭЧНе100 + СтрПлан.ЭЧ;
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.ИтогоЭЧ100 = ИтогоЭЧ100;
	ЭтаФорма.ИтогоЭЧНе100 = ИтогоЭЧНе100;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПоКлиентамПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РассчитатьИтогиЭЧ();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВероятностьВыполненияПлана()
	
	Возврат Справочники.ВероятностьФактЭЧ.Сто;
	
КонецФункции 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РассчитатьИтогиЭЧ();
КонецПроцедуры

&НаСервере
Функция ПроверкаДублированияСтрокиКомпетенции(ъПараметр)
	ПараметрОтбора = Новый Структура;
	ПараметрОтбора.Вставить("Компетенция",ъПараметр);
	РезультатПоиска = Объект.ПланСертификации.НайтиСтроки(ПараметрОтбора);
	Если РезультатПоиска.Количество() > 1 тогда
		Сообщить("Нельзя повторно выбрать компетенцию. Используете уже добавленную строку");
		возврат Истина
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПланСертификацииКомпетенцияПриИзменении(Элемент)
	ъКомпетенция =Элементы.ПланСертификации.ТекущиеДанные.Компетенция;
	Результат = ПроверкаДублированияСтрокиКомпетенции(ъКомпетенция);
	Если Результат = Истина 
		тогда
		Объект.ПланСертификации.Удалить(Элементы.ПланСертификации.ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая()
		тогда 
		Компетенции = Новый Запрос;
		Компетенции.Текст = "ВЫБРАТЬ
		|	Компетенции.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Компетенции КАК Компетенции";
		ВыборкаКомпетенций =Компетенции.Выполнить().Выбрать();
		Пока ВыборкаКомпетенций.Следующий() Цикл
			Строка =Объект.ПланСертификации.Добавить();
			Строка.Компетенция = ВыборкаКомпетенций.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
Процедура ЗаполнитьКомпетенции()
	Сертефикаты = Новый Запрос;
	Сертефикаты.Текст =  "ВЫБРАТЬ
	|	УчетСертефикации.Компетенция КАК Компетенция,
	|	УчетСертефикации.ТипКомпетенции КАК ТипКомпетенции,
	|	УчетСертефикации.ДатаПлан КАК ДатаПлан,
	|	УчетСертефикации.ДатаФакт КАК ДатаФакт
	|ИЗ
	|	РегистрСведений.УчетСертефикации КАК УчетСертефикации
	|ГДЕ
	|	УчетСертефикации.Сотрудник = &Сотрудник
	|	И УчетСертефикации.ДатаФакт <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)" ;
	Сертефикаты.УстановитьПараметр("Сотрудник",Объект.Сотрудник);
	СписокСертефикатов = Сертефикаты.Выполнить().Выбрать();
	Пока   СписокСертефикатов.Следующий() Цикл
		ъОтбор = Новый Структура;
		ъОтбор.Вставить("Компетенция",СписокСертефикатов.Компетенция);
		Строка = Объект.ПланСертификации.НайтиСтроки(ъОтбор);
		Если Строка.Количество() > 0 тогда
			Если СписокСертефикатов.ТипКомпетенции = Перечисления.ТипКомпетенции.ПРОФ
				тогда Строка[0].Проф = Истина;
				Строка[0].ПрофФакт = СписокСертефикатов.ДатаФакт;
			ИначеЕсли СписокСертефикатов.ТипКомпетенции = Перечисления.ТипКомпетенции.СК
				тогда  Строка[0].СК = Истина;
				Строка[0].СКФакт = СписокСертефикатов.ДатаФакт;
			ИначеЕсли СписокСертефикатов.ТипКомпетенции = Перечисления.ТипКомпетенции.СПЕЦ
				тогда  Строка[0].Спец = Истина;
				Строка[0].СпецФакт = СписокСертефикатов.ДатаФакт;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПоКлиентамПриАктивизацииСтроки(Элемент)
	Строка = ЭтаФорма.Элементы.ПланПоКлиентам.ТекущиеДанные;
	Если Строка.Отменена = Истина Тогда
		ЭтаФорма.Элементы.ПричинаОтменыФорма.Видимость = Истина
	иначе 
		ЭтаФорма.Элементы.ПричинаОтменыФорма.Видимость = Ложь
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланПоКлиентамЗадачаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	//СтандартнаяОбработка = Ложь;
	
	
	Если  ЗначениеЗаполнено(ЭтаФорма.Элементы.ПланПоКлиентам.ТекущиеДанные.Клиент) Тогда
		//ъСписок = Новый Массив;
		//ъСписок.Добавить(Объект.Сотрудник);
		//ъСписок.Добавить( ПустойСотрудник ());
		//НовыйПараметрСотрудник = Новый ПараметрВыбора ("Отбор.Ответственный",ъСписок);
		НовыйПараметрКлиент = Новый ПараметрВыбора ("Отбор.Клиент",ЭтаФорма.Элементы.ПланПоКлиентам.ТекущиеДанные.Клиент);
		НовыйМассив = Новый Массив;
		НовыйМассив.Добавить(НовыйПараметрКлиент);
		//НовыйМассив.Добавить(НовыйПараметрСотрудник);
		НовыеПараметры = Новый ФиксированныйМассив (НовыйМассив);
		Элементы.ПланПоКлиентамЗадача.ПараметрыВыбора = НовыеПараметры;
	Иначе 
		
		Оповещение = Новый ОписаниеОповещения("ПослеПроверкиКлиента",
		ЭтотОбъект);	
		ПоказатьВопрос(Оповещение,
		"Прежде чем выбрать задачу необходимо указать клиента",
		РежимДиалогаВопрос.ОК,
		0,
		,
		"Не выбран Клиент"
		);
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПослеПроверкиКлиента(Результат, Параметры) Экспорт
	
КонецПроцедуры
